Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
         + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "eks-demo-b-worker"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                             = "eks-demo-b-worker"
          + "kubernetes.io/cluster/eks-demo-b" = "owned"
        }
      + tags_all               = {
          + "Name"                             = "eks-demo-b-worker"
          + "kubernetes.io/cluster/eks-demo-b" = "owned"
        }
      + vpc_id                 = "vpc-0a42049ec518342a3"
    }

  # module.eks.aws_security_group_rule.cluster_vpn will be created
+ resource "aws_security_group_rule" "cluster_vpn" {
      + cidr_blocks              = [
          + "10.0.0.0/8",
        ]
      + description              = "Allow vpn to communicate with the cluster API Server"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.cluster_worker will be created
+ resource "aws_security_group_rule" "cluster_worker" {
      + description              = "Allow workers to communicate with the cluster API Server"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_cluster will be created
+ resource "aws_security_group_rule" "worker_cluster" {
      + description              = "Allow to communicate between master and workers (eks-demo-b-worker)"
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_cluster_10250 will be created
+ resource "aws_security_group_rule" "worker_cluster_10250" {
      + description              = "Allow to communicate between master and workers (eks-demo-b-worker)"
      + from_port                = 10250
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_cluster_443 will be created
+ resource "aws_security_group_rule" "worker_cluster_443" {
      + description              = "Allow to communicate between master and workers (eks-demo-b-worker)"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_source[0] will be created
+ resource "aws_security_group_rule" "worker_source" {
      + description              = "Allow to communicate between source and workers (eks-demo-b-worker)"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-09cfa5f5483a6dfa8"
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_ssh will be created
+ resource "aws_security_group_rule" "worker_ssh" {
      + cidr_blocks              = [
          + "10.0.0.0/8",
        ]
      + description              = "Allow to communicate between ssh and workers (eks-demo-b-worker)"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.worker_worker will be created
+ resource "aws_security_group_rule" "worker_worker" {
      + description              = "Allow to communicate between workers (eks-demo-b-worker)"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.eks.aws_sqs_queue.worker will be created
+ resource "aws_sqs_queue" "worker" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 300
      + name                              = "eks-demo-b-worker"
      + name_prefix                       = (known after apply)
      + policy                            = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sqs:SendMessage"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "events.amazonaws.com",
                              + "sqs.amazonaws.com",
                            ]
                        }
                      + Resource  = "arn:aws:sqs:ap-northeast-2:082867736673:eks-demo-b-worker"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + receive_wait_time_seconds         = 0
      + tags                              = {
          + "Name"                             = "eks-demo-b-worker"
          + "kubernetes.io/cluster/eks-demo-b" = "owned"
        }
      + tags_all                          = {
          + "Name"                             = "eks-demo-b-worker"
          + "kubernetes.io/cluster/eks-demo-b" = "owned"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.eks.kubernetes_config_map.aws_auth will be created
+ resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapRoles" = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::082867736673:role/eks-demo-b-worker"
                  "username": "system:node:{{EC2PrivateDNSName}}"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::082867736673:role/atlantis-ecs_task_execution"
                  "username": "atlantis"
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::082867736673:role/k8s-master"
                  "username": "k8s-master"
                - "groups": []
                  "rolearn": "arn:aws:iam::082867736673:role/k8s-readonly"
                  "username": "k8s-readonly"
            EOT
          + "mapUsers" = <<-EOT
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::082867736673:user/ops"
                  "username": "iam-user-ops"
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::082867736673:user/bruce"
                  "username": "iam-user-bruce"
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::082867736673:user/jungyoul.yu"
                  "username": "iam-user-jungyoul.yu"
            EOT
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.irsa["aws-ebs-csi-driver"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:addon-aws-ebs-csi-driver:ebs-csi-controller-sa",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.irsa["aws-ebs-csi-driver"].aws_iam_policy.irsa will be created
+ resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "irsa--eks-demo-b--aws-ebs-csi-driver policy"
      + id          = (known after apply)
      + name        = "irsa--eks-demo-b--aws-ebs-csi-driver"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:AttachVolume",
                          + "ec2:CreateSnapshot",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeSnapshots",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeVolumes",
                          + "ec2:DescribeVolumesModifications",
                          + "ec2:DetachVolume",
                          + "ec2:ModifyVolume",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "ec2:CreateAction" = [
                                  + "CreateVolume",
                                  + "CreateSnapshot",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ec2:DeleteTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/CSIVolumeName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/CSIVolumeName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteSnapshot",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/CSIVolumeSnapshotName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteSnapshot",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["aws-ebs-csi-driver"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-b--aws-ebs-csi-driver"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-b--aws-ebs-csi-driver"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-b--aws-ebs-csi-driver"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.irsa["aws-ebs-csi-driver"].aws_iam_role_policy_attachment.irsa will be created
+ resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "irsa--eks-demo-b--aws-ebs-csi-driver"
    }

  # module.irsa["aws-efs-csi-driver"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:addon-aws-efs-csi-driver:efs-csi-controller-sa",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.irsa["aws-efs-csi-driver"].aws_iam_policy.irsa will be created
+ resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "irsa--eks-demo-b--aws-efs-csi-driver policy"
      + id          = (known after apply)
      + name        = "irsa--eks-demo-b--aws-efs-csi-driver"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "elasticfilesystem:DescribeAccessPoints",
                          + "elasticfilesystem:DescribeFileSystems",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticfilesystem:CreateAccessPoint",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/efs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = "elasticfilesystem:DeleteAccessPoint"
                      + Condition = {
                          + StringEquals = {
                              + "aws:ResourceTag/efs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["aws-efs-csi-driver"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-b--aws-efs-csi-driver"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-b--aws-efs-csi-driver"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-b--aws-efs-csi-driver"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.irsa["aws-efs-csi-driver"].aws_iam_role_policy_attachment.irsa will be created
+ resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "irsa--eks-demo-b--aws-efs-csi-driver"
    }

  # module.irsa["aws-load-balancer-controller"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:addon-aws-load-balancer-controller:aws-load-balancer-controller",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.irsa["aws-load-balancer-controller"].aws_iam_policy.irsa will be created
+ resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "irsa--eks-demo-b--aws-load-balancer-controller policy"
      + id          = (known after apply)
      + name        = "irsa--eks-demo-b--aws-load-balancer-controller"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "iam:CreateServiceLinkedRole",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeCoipPools",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["aws-load-balancer-controller"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-b--aws-load-balancer-controller"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-b--aws-load-balancer-controller"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-b--aws-load-balancer-controller"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.irsa["aws-load-balancer-controller"].aws_iam_role_policy_attachment.irsa will be created
+ resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "irsa--eks-demo-b--aws-load-balancer-controller"
    }

  # module.irsa["aws-node"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-node",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.irsa["aws-node"].aws_iam_policy.irsa will be created
+ resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "irsa--eks-demo-b--aws-node policy"
      + id          = (known after apply)
      + name        = "irsa--eks-demo-b--aws-node"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:AssignIpv6Addresses",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeInstanceTypes",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ec2:*:*:network-interface/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["aws-node"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-b--aws-node"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-b--aws-node"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-b--aws-node"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.irsa["aws-node"].aws_iam_role_policy_attachment.irsa will be created
+ resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "irsa--eks-demo-b--aws-node"
    }

  # module.irsa["aws-node-termination-handler"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:addon-aws-node-termination-handler:aws-node-termination-handler",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.irsa["aws-node-termination-handler"].aws_iam_policy.irsa will be created
+ resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "irsa--eks-demo-b--aws-node-termination-handler policy"
      + id          = (known after apply)
      + name        = "irsa--eks-demo-b--aws-node-termination-handler"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "autoscaling:CompleteLifecycleAction",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeTags",
                          + "ec2:DescribeInstances",
                          + "sqs:DeleteMessage",
                          + "sqs:ReceiveMessage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["aws-node-termination-handler"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-b--aws-node-termination-handler"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-b--aws-node-termination-handler"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-b--aws-node-termination-handler"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.irsa["aws-node-termination-handler"].aws_iam_role_policy_attachment.irsa will be created
+ resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "irsa--eks-demo-b--aws-node-termination-handler"
    }

  # module.irsa["cluster-autoscaler"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:addon-cluster-autoscaler:cluster-autoscaler",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.irsa["cluster-autoscaler"].aws_iam_policy.irsa will be created
+ resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "irsa--eks-demo-b--cluster-autoscaler policy"
      + id          = (known after apply)
      + name        = "irsa--eks-demo-b--cluster-autoscaler"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "autoscaling:DescribeAutoScalingGroups",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:DescribeTags",
                          + "autoscaling:SetDesiredCapacity",
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                          + "autoscaling:UpdateAutoScalingGroup",
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "ec2:DescribeInstanceTypes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["cluster-autoscaler"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-b--cluster-autoscaler"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-b--cluster-autoscaler"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-b--cluster-autoscaler"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.irsa["cluster-autoscaler"].aws_iam_role_policy_attachment.irsa will be created
+ resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "irsa--eks-demo-b--cluster-autoscaler"
    }

  # module.irsa["external-dns"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:addon-external-dns:external-dns",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.irsa["external-dns"].aws_iam_policy.irsa will be created
+ resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "irsa--eks-demo-b--external-dns policy"
      + id          = (known after apply)
      + name        = "irsa--eks-demo-b--external-dns"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "route53:ChangeResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:route53:::hostedzone/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "route53:ListHostedZones",
                          + "route53:ListResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["external-dns"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-b--external-dns"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-b--external-dns"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-b--external-dns"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.irsa["external-dns"].aws_iam_role_policy_attachment.irsa will be created
+ resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "irsa--eks-demo-b--external-dns"
    }

  # module.irsa["external-secrets"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:addon-external-secrets:external-secrets",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.irsa["external-secrets"].aws_iam_policy.irsa will be created
+ resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "irsa--eks-demo-b--external-secrets policy"
      + id          = (known after apply)
      + name        = "irsa--eks-demo-b--external-secrets"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:Decrypt",
                          + "kms:DescribeKey",
                          + "kms:Encrypt",
                          + "secretsmanager:DescribeSecret",
                          + "secretsmanager:Get*",
                          + "ssm:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:*:*:secret:/k8s/bruce/*",
                          + "arn:aws:secretsmanager:*:*:secret:/k8s/common/*",
                          + "arn:aws:secretsmanager:*:*:secret:/k8s/daangn/*",
                          + "arn:aws:secretsmanager:*:*:secret:/k8s/opspresso/*",
                          + "arn:aws:ssm:*:*:parameter/k8s/bruce/*",
                          + "arn:aws:ssm:*:*:parameter/k8s/common/*",
                          + "arn:aws:ssm:*:*:parameter/k8s/daangn/*",
                          + "arn:aws:ssm:*:*:parameter/k8s/opspresso/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["external-secrets"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-b--external-secrets"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-b--external-secrets"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-b--external-secrets"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.irsa["external-secrets"].aws_iam_role_policy_attachment.irsa will be created
+ resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "irsa--eks-demo-b--external-secrets"
    }

  # module.irsa["irsa-operator"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:addon-irsa-operator:irsa-operator",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.irsa["irsa-operator"].aws_iam_policy.irsa will be created
+ resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "irsa--eks-demo-b--irsa-operator policy"
      + id          = (known after apply)
      + name        = "irsa--eks-demo-b--irsa-operator"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iam:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::*:policy/irsa-operator/*",
                          + "arn:aws:iam::*:role/irsa-op-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "iam:Get*",
                          + "iam:List*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["irsa-operator"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-b--irsa-operator"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-b--irsa-operator"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-b--irsa-operator"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.irsa["irsa-operator"].aws_iam_role_policy_attachment.irsa will be created
+ resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "irsa--eks-demo-b--irsa-operator"
    }

  # module.irsa["karpenter"].data.aws_iam_policy_document.irsa will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:addon-karpenter:karpenter",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.irsa["karpenter"].aws_iam_policy.irsa will be created
+ resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "irsa--eks-demo-b--karpenter policy"
      + id          = (known after apply)
      + name        = "irsa--eks-demo-b--karpenter"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:CreateLaunchTemplate",
                          + "ec2:CreateFleet",
                          + "ec2:RunInstances",
                          + "ec2:CreateTags",
                          + "iam:PassRole",
                          + "ec2:TerminateInstances",
                          + "ec2:DescribeLaunchTemplates",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DescribeInstanceTypeOfferings",
                          + "ec2:DescribeAvailabilityZones",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.irsa["karpenter"].aws_iam_role.irsa will be created
+ resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "irsa--eks-demo-b--karpenter"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "irsa--eks-demo-b--karpenter"
        }
      + tags_all              = {
          + "Name" = "irsa--eks-demo-b--karpenter"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.irsa["karpenter"].aws_iam_role_policy_attachment.irsa will be created
+ resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "irsa--eks-demo-b--karpenter"
    }

  # module.monitoring-v1.data.aws_ami.worker will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ami" "worker" {
      + architecture          = (known after apply)
      + arn                   = (known after apply)
      + block_device_mappings = (known after apply)
      + boot_mode             = (known after apply)
      + creation_date         = (known after apply)
      + deprecation_time      = (known after apply)
      + description           = (known after apply)
      + ena_support           = (known after apply)
      + hypervisor            = (known after apply)
      + id                    = (known after apply)
      + image_id              = (known after apply)
      + image_location        = (known after apply)
      + image_owner_alias     = (known after apply)
      + image_type            = (known after apply)
      + kernel_id             = (known after apply)
      + most_recent           = true
      + name                  = (known after apply)
      + owner_id              = (known after apply)
      + owners                = [
          + "602401143452",
        ]
      + platform              = (known after apply)
      + platform_details      = (known after apply)
      + product_codes         = (known after apply)
      + public                = (known after apply)
      + ramdisk_id            = (known after apply)
      + root_device_name      = (known after apply)
      + root_device_type      = (known after apply)
      + root_snapshot_id      = (known after apply)
      + sriov_net_support     = (known after apply)
      + state                 = (known after apply)
      + state_reason          = (known after apply)
      + tags                  = (known after apply)
      + tpm_support           = (known after apply)
      + usage_operation       = (known after apply)
      + virtualization_type   = (known after apply)

      + filter {
          + name   = "name"
          + values = [
              + (known after apply),
            ]
        }

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.monitoring-v1.data.aws_sqs_queue.nth[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_sqs_queue" "nth" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = (known after apply)
      + tags = (known after apply)
      + url  = (known after apply)
    }

  # module.monitoring-v1.aws_autoscaling_group.worker[0] will be created
+ resource "aws_autoscaling_group" "worker" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupPendingCapacity",
          + "GroupPendingInstances",
          + "GroupStandbyCapacity",
          + "GroupStandbyInstances",
          + "GroupTerminatingCapacity",
          + "GroupTerminatingInstances",
          + "GroupTotalCapacity",
          + "GroupTotalInstances",
        ]
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = (known after apply)
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + termination_policies      = [
          + "OldestInstance",
        ]
      + vpc_zone_identifier       = [
          + "subnet-0842c4c3776c09e81",
        ]
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = (known after apply)
          + propagate_at_launch = (known after apply)
          + value               = (known after apply)
        }
    }

  # module.monitoring-v1.aws_autoscaling_lifecycle_hook.nth[0] will be created
+ resource "aws_autoscaling_lifecycle_hook" "nth" {
      + autoscaling_group_name = (known after apply)
      + default_result         = "CONTINUE"
      + heartbeat_timeout      = 300
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = "aws-node-termination-handler"
    }

  # module.monitoring-v1.aws_cloudwatch_event_rule.nth_asg[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_asg" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = (known after apply)
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.monitoring-v1.aws_cloudwatch_event_rule.nth_scheduled[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_scheduled" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = (known after apply)
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.monitoring-v1.aws_cloudwatch_event_rule.nth_spot[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_spot" {
      + arn            = (known after apply)
      + description    = "Node termination event rule"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + id             = (known after apply)
      + is_enabled     = true
      + name           = (known after apply)
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.monitoring-v1.aws_cloudwatch_event_rule.nth_state[0] will be created
+ resource "aws_cloudwatch_event_rule" "nth_state" {
      + arn            = (known after apply)
      + description    = "Node ter
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.